In [1]:
import numpy as np
import pandas as pd

In [2]:
nfl = pd.read_csv("C:/python/datas/nfl.csv", parse_dates = ["Birthday"])
nfl.reset_index().set_index("Team").loc["New York Jets"].nsmallest(1, "Birthday")

               index        Name Position   Birthday   Salary
Team
New York Jets    888  Ryan Kalil        C 1985-03-29  2400000

In [3]:
data1 = {
    "이름" : ["일식", "이식", "삼식", "사식", "오식"],
    "국어" : [60, 70, 90, 80, 100],
    "영어" : [70, 86, 82, 88, 100],
    "수학" : [65, 82, 85, 90, 100]
}

df1 = pd.DataFrame(data1).set_index("이름")
print(df1) # 이름이 index 컬럼인 DataFrame 생성

df1 = df1.reset_index()
df1 # "이름" index 컬럼을 다시 DataFrame으로 반환

     국어   영어   수학
이름
일식   60   70   65
이식   70   86   82
삼식   90   82   85
사식   80   88   90
오식  100  100  100

   이름   국어   영어   수학
0  일식   60   70   65
1  이식   70   86   82
2  삼식   90   82   85
3  사식   80   88   90
4  오식  100  100  100